OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x6.h
/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief Analog to Digital Converter
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< ADC interrupt and status register,             Address offset: 0x00 */
  __IO uint32_t IER;              /*!< ADC interrupt enable register,                 Address offset: 0x04 */
  __IO uint32_t CR;               /*!< ADC control register,                          Address offset: 0x08 */
  __IO uint32_t CFGR1;            /*!< ADC configuration register 1,                  Address offset: 0x0C */
  __IO uint32_t CFGR2;            /*!< ADC configuration register 2,                  Address offset: 0x10 */
  __IO uint32_t SMPR0;            /*!< ADC sampling time register 0,                  Address offset: 0x14 */
  __IO uint32_t SMPR1;            /*!< ADC sampling time register 1,                  Address offset: 0x18 */
       uint32_t RESERVED1;        /*!< Reserved,                                                 0x1C-0x1F */
  __IO uint32_t TR;               /*!< ADC analog watchdog 1 threshold register,      Address offset: 0x20 */
  __IO uint32_t CHSELR;           /*!< ADC group regular sequencer register,          Address offset: 0x24 */
  __IO uint32_t SEQR0;            /*!< ADC sequence selection register 0,             Address offset: 0x28 */
  __IO uint32_t SEQR1;            /*!< ADC sequence selection register 1,             Address offset: 0x2C */
       uint32_t RESERVED2[4];     /*!< Reserved,                                                 0x30-0x3F */
  __IO uint32_t DR;               /*!< ADC group regular data register,               Address offset: 0x40 */
  __IO uint32_t CCSR;             /*!< ADC calibration configuration&status register  Address offset: 0x44 */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CCR;              /*!< ADC common configuration register,             Address offset: ADC1 base address + 0x308 */
} ADC_Common_TypeDef;

/**
  * @brief CRC calculation unit
  */
typedef struct
{
  __IO uint32_t DR;               /*!< CRC Data register,                         Address offset: 0x00 */
  __IO uint32_t IDR;              /*!< CRC Independent data register,             Address offset: 0x04 */
  __IO uint32_t CR;               /*!< CRC Control register,                      Address offset: 0x08 */
} CRC_TypeDef;

/**
  * @brief CORDIC Digital Co-process Operation
  */
typedef struct
{
  __IO uint32_t CR;               /*!< CORDIC Control register,                      Address offset: 0x00 */
  __IO uint32_t THETA;            /*!< CORDIC Input theta register,                  Address offset: 0x04 */
  __IO uint32_t SIN;              /*!< CORDIC Sin result register,                   Address offset: 0x08 */
  __IO uint32_t COS;              /*!< CORDIC Cos result register,                   Address offset: 0x0C */
  __IO uint32_t X;                /*!< CORDIC Arctan input coordinate register,      Address offset: 0x10 */
  __IO uint32_t Y;                /*!< CORDIC Arctan input coordinate register,      Address offset: 0x14 */
  __IO uint32_t MOD;              /*!< CORDIC Mod result register,                   Address offset: 0x18 */
  __IO uint32_t ARCTAN;           /*!< CORDIC Arctan result register,                Address offset: 0x1C */
  __IO uint32_t DSP_RAD;          /*!< CORDIC Radicand register,                     Address offset: 0x20 */
  __IO uint32_t DSP_SQRT;         /*!< CORDIC Sqrt result register,                  Address offset: 0x24 */
  __IO uint32_t SR;               /*!< CORDIC Status register,                       Address offset: 0x28 */
} CORDIC_TypeDef;

/**
  * @brief Comparator
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< COMP control and status register,           Address offset: 0x00 */
  __IO uint32_t FR;               /*!< COMP filter register,                       Address offset: 0x04 */
} COMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR_ODD;          /*!< COMP control and status register located in register of comparator instance odd, used for bits common to several COMP instances, Address offset: 0x00 */
  __IO uint32_t FR_ODD;
       uint32_t RESERVED[2];      /*Reserved*/
  __IO uint32_t CSR_EVEN;         /*!< COMP control and status register located in register of comparator instance even, used for bits common to several COMP instances, Address offset: 0x04 */
  __IO uint32_t FR_EVEN;
} COMP_Common_TypeDef;

/**
  * @brief Comparator
  */
typedef struct
{
       uint32_t RESERVED1[12];    /*!< Reserved,                                            0x00 - 0x2F  */
  __IO uint32_t OENR;              /*!< OPA output enable register,                 Address offset: 0x30 */
  __IO uint32_t CR;                /*!< OPA control register,                       Address offset: 0x34 */
} OPA_TypeDef;

/**
  * @brief Debug MCU
  */
typedef struct
{
  __IO uint32_t IDCODE;           /*!< MCU device ID code,              Address offset: 0x00 */
  __IO uint32_t CR;               /*!< Debug configuration register,    Address offset: 0x04 */
  __IO uint32_t APBFZ1;           /*!< Debug APB freeze register 1,     Address offset: 0x08 */
  __IO uint32_t APBFZ2;           /*!< Debug APB freeze register 2,     Address offset: 0x0C */
} DBGMCU_TypeDef;

/**
* @brief HDIV Registers
*/
typedef struct
{
  __IO uint32_t DEND;             /*!< HDIV desc DEND, Address offset: 0x00 */
  __IO uint32_t SOR;              /*!< HDIV desc SOR,  Address offset: 0x04 */
  __IO uint32_t QUOT;             /*!< HDIV desc QUOT, Address offset: 0x08 */
  __IO uint32_t REMD;             /*!< HDIV desc REMD, Address offset: 0x0C */
  __IO uint32_t SIGN;             /*!< HDIV desc SIGN, Address offset: 0x10 */
  __IO uint32_t STAT;             /*!< HDIV desc STAT, Address offset: 0x1C */
} HDIV_TypeDef;

/**
  * @brief DMA Controller
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< DMA interrupt status register,                 Address offset: 0x00 */
  __IO uint32_t IFCR;             /*!< DMA interrupt flag clear register,             Address offset: 0x04 */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t CCR;              /*!< DMA channel x configuration register        */
  __IO uint32_t CNDTR;            /*!< DMA channel x number of data register       */
  __IO uint32_t CPAR;             /*!< DMA channel x peripheral address register   */
  __IO uint32_t CMAR;             /*!< DMA channel x memory address register       */
} DMA_Channel_TypeDef;

/**
  * @brief Asynch Interrupt/Event Controller (EXTI)
  */
typedef struct
{
  __IO uint32_t RTSR;          /*!< EXTI Rising Trigger Selection Register 1,        Address offset:   0x00 */
  __IO uint32_t FTSR;          /*!< EXTI Falling Trigger Selection Register 1,       Address offset:   0x04 */
  __IO uint32_t SWIER;         /*!< EXTI Software Interrupt event Register 1,        Address offset:   0x08 */
  __IO uint32_t PR;            /*!< EXTI Pending Register 1                          Address offset:   0x0C */
  uint32_t RESERVED1[20];      /*!< Reserved 1,                                      Address offset:   0x10 -- 0x5C */
  __IO uint32_t EXTICR[4];     /*!< EXTI External Interrupt Configuration Register,  Address offset:   0x60 -- 0x6C */
  uint32_t RESERVED2[4];       /*!< Reserved 2,                                      Address offset:   0x70 -- 0x7C */
  __IO uint32_t IMR;           /*!< EXTI Interrupt Mask Register,                    Address offset:   0x80 */
  __IO uint32_t EMR;           /*!< EXTI Event Mask Register,                        Address offset:   0x84 */
} EXTI_TypeDef;

/**
  * @brief FLASH Registers
  */
typedef struct
{
  __IO uint32_t ACR;              /*!< FLASH Access Control register,                     Address offset: 0x00 */
  uint32_t RESERVED1;             /*!< Reserved1,                                         Address offset: 0x04 */
  __IO uint32_t KEYR;             /*!< FLASH Key register,                                Address offset: 0x08 */
  __IO uint32_t OPTKEYR;          /*!< FLASH Option Key register,                         Address offset: 0x0C */
  __IO uint32_t SR;               /*!< FLASH Status register,                             Address offset: 0x10 */
  __IO uint32_t CR;               /*!< FLASH Control register,                            Address offset: 0x14 */
  uint32_t RESERVED2[2];          /*!< Reserved2,                                         Address offset: 0x18-0x1C */
  __IO uint32_t OPTR;             /*!< FLASH Option register,                             Address offset: 0x20 */
  __IO uint32_t SDKR;             /*!< FLASH SDK address register,                        Address offset: 0x24 */
  uint32_t RESERVED3;             /*!< Reserved2,                                         Address offset: 0x28 */
  __IO uint32_t WRPR;             /*!< FLASH WRP address register,                        Address offset: 0x2C */
  uint32_t RESERVED4[(0x90 - 0x2C) / 4 - 1];
  __IO uint32_t STCR;             /*!< FLASH sleep time config register,                  Address offset: 0x90 */
  uint32_t RESERVED5[(0x100 - 0x90) / 4 - 1];
  __IO uint32_t TS0;              /*!< FLASH TS0 register,                                Address offset: 0x100 */
  __IO uint32_t TS1;              /*!< FLASH TS1 register,                                Address offset: 0x104 */
  __IO uint32_t TS2P;             /*!< FLASH TS2P register,                               Address offset: 0x108 */
  __IO uint32_t TPS3;             /*!< FLASH TPS3 register,                               Address offset: 0x10C */
  __IO uint32_t TS3;              /*!< FLASH TS3 register,                                Address offset: 0x110 */
  __IO uint32_t PERTPE;           /*!< FLASH PERTPE register,                             Address offset: 0x114 */
  __IO uint32_t SMERTPE;          /*!< FLASH SMERTPE register,                            Address offset: 0x118 */
  __IO uint32_t PRGTPE;           /*!< FLASH PRGTPE register,                             Address offset: 0x11C */
  __IO uint32_t PRETPE;           /*!< FLASH PRETPE register,                             Address offset: 0x120 */
} FLASH_TypeDef;

/**
  * @brief Option Bytes
  */
typedef struct
{
  __IO uint8_t RDP;               /*!< FLASH option byte Read protection,                 Address offset: 0x00 */
  __IO uint8_t USER;              /*!< FLASH option byte user options,                    Address offset: 0x01 */
  __IO uint8_t nRDP;              /*!< Complemented FLASH option byte Read protection,    Address offset: 0x02 */
  __IO uint8_t nUSER;             /*!< Complemented FLASH option byte user options,       Address offset: 0x03 */
  __IO uint8_t BOR;               /*!< FLASH option byte BOR Configuration                Address offset: 0x04 */
  uint8_t RESERVED1;              /*!< RESERVED1,                                         Address offset: 0x05 */
  __IO uint8_t nBOR;              /*!< Complemented FLASH option byte BOR Configuration   Address offset: 0x06 */
  uint8_t RESERVED2;              /*!< RESERVED2                                          Address offset: 0x07 */
  __IO uint8_t SDK_STRT;          /*!< SDK area start address(stored in SDK[4:0]),        Address offset: 0x08 */
  __IO uint8_t SDK_END;           /*!< SDK area end address(stored in SDK[12:8]),         Address offset: 0x09 */
  __IO uint8_t nSDK_STRT;         /*!< Complemented SDK area start address,               Address offset: 0x0A */
  __IO uint8_t nSDK_END;          /*!< Complemented SDK area end address,                 Address offset: 0x0B */
  // uint32_t RESERVED3;             /*!< RESERVED3,                                                           */
  __IO uint16_t WRP;              /*!< FLASH option byte write protection,                Address offset: 0x0C */
  __IO uint16_t nWRP;             /*!< Complemented FLASH option byte write protection    Address offset: 0x0E */
} OB_TypeDef;

/**
  * @brief General Purpose I/O
  */
typedef struct
{
  __IO uint32_t MODER;            /*!< GPIO port mode register,               Address offset: 0x00      */
  __IO uint32_t OTYPER;           /*!< GPIO port output type register,        Address offset: 0x04      */
  __IO uint32_t OSPEEDR;          /*!< GPIO port output speed register,       Address offset: 0x08      */
  __IO uint32_t PUPDR;            /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
  __IO uint32_t IDR;              /*!< GPIO port input data register,         Address offset: 0x10      */
  __IO uint32_t ODR;              /*!< GPIO port output data register,        Address offset: 0x14      */
  __IO uint32_t BSRR;             /*!< GPIO port bit set/reset  register,     Address offset: 0x18      */
  __IO uint32_t LCKR;             /*!< GPIO port configuration lock register, Address offset: 0x1C      */
  __IO uint32_t AFR[2];           /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
  __IO uint32_t BRR;              /*!< GPIO Bit Reset register,               Address offset: 0x28      */
} GPIO_TypeDef;

/**
  * @brief Inter-integrated Circuit Interface
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< I2C Control register 1,                Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< I2C Control register 2,                Address offset: 0x04 */
  __IO uint32_t OAR1;             /*!< I2C Own address register 1,            Address offset: 0x08 */
  uint32_t RESERVED1;             /*!< RESERVED1,                             Address offset: 0x0C */
  __IO uint32_t DR;               /*!< I2C Data register,                     Address offset: 0x10 */
  __IO uint32_t SR1;              /*!< I2C Status register 1,                 Address offset: 0x14 */
  __IO uint32_t SR2;              /*!< I2C Status register 2,                 Address offset: 0x18 */
  __IO uint32_t CCR;              /*!< I2C Clock control register,            Address offset: 0x1C */
  __IO uint32_t TRISE;            /*!< I2C TRISE register,                    Address offset: 0x20 */
} I2C_TypeDef;

/**
  * @brief Independent WATCHDOG
  */
typedef struct
{
  __IO uint32_t KR;               /*!< IWDG Key register,       Address offset: 0x00 */
  __IO uint32_t PR;               /*!< IWDG Prescaler register, Address offset: 0x04 */
  __IO uint32_t RLR;              /*!< IWDG Reload register,    Address offset: 0x08 */
  __IO uint32_t SR;               /*!< IWDG Status register,    Address offset: 0x0C */
} IWDG_TypeDef;

/**
  * @brief LPTIMER
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< LPTIM Interrupt and Status register,                Address offset: 0x00 */
  __IO uint32_t ICR;              /*!< LPTIM Interrupt Clear register,                     Address offset: 0x04 */
  __IO uint32_t IER;              /*!< LPTIM Interrupt Enable register,                    Address offset: 0x08 */
  __IO uint32_t CFGR;             /*!< LPTIM Configuration register,                       Address offset: 0x0C */
  __IO uint32_t CR;               /*!< LPTIM Control register,                             Address offset: 0x10 */
  __IO uint32_t RESERVED1;        /*!< RESERVED1,                                          Address offset: 0x14 */
  __IO uint32_t ARR;              /*!< LPTIM Autoreload register,                          Address offset: 0x18 */
  __IO uint32_t CNT;              /*!< LPTIM Counter register,                             Address offset: 0x1C */
} LPTIM_TypeDef;

/**
  * @brief Power Control
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< PWR Power Control Register 1,                     Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< PWR Power Control Register 2,                     Address offset: 0x04 */
  uint32_t RESERVED1[3];          /*!< Reserved1,                                        Address offset: 0x08-0x10 */
  __IO uint32_t SR;               /*!< PWR Power Status Register,                        Address offset: 0x14 */
} PWR_TypeDef;

/**
  * @brief Reset and Clock Control
  */
typedef struct
{
  __IO uint32_t CR;               /*!< RCC Clock Sources Control Register,                                     Address offset: 0x00 */
  __IO uint32_t ICSCR;            /*!< RCC Internal Clock Sources Calibration Register,                        Address offset: 0x04 */
  __IO uint32_t CFGR;             /*!< RCC Regulated Domain Clocks Configuration Register,                     Address offset: 0x08 */
  __IO uint32_t PLLCFGR;          /*!< RCC System PLL configuration Register,                                  Address offset: 0x0C */
  __IO uint32_t ECSCR;            /*!< RCC External clock source control register,                             Address offset: 0x10 */
  __IO uint32_t RESERVED1;        /*!< Reserved,                                                               Address offset: 0x14 */
  __IO uint32_t CIER;             /*!< RCC Clock Interrupt Enable Register,                                    Address offset: 0x18 */
  __IO uint32_t CIFR;             /*!< RCC Clock Interrupt Flag Register,                                      Address offset: 0x1C */
  __IO uint32_t CICR;             /*!< RCC Clock Interrupt Clear Register,                                     Address offset: 0x20 */
  __IO uint32_t IOPRSTR;          /*!< RCC IO port reset register,                                             Address offset: 0x24 */
  __IO uint32_t AHBRSTR;          /*!< RCC AHB peripherals reset register,                                     Address offset: 0x28 */
  __IO uint32_t APBRSTR1;         /*!< RCC APB peripherals reset register 1,                                   Address offset: 0x2C */
  __IO uint32_t APBRSTR2;         /*!< RCC APB peripherals reset register 2,                                   Address offset: 0x30 */
  __IO uint32_t IOPENR;           /*!< RCC IO port enable register,                                            Address offset: 0x34 */
  __IO uint32_t AHBENR;           /*!< RCC AHB peripherals clock enable register,                              Address offset: 0x38 */
  __IO uint32_t APBENR1;          /*!< RCC APB peripherals clock enable register1,                             Address offset: 0x3C */
  __IO uint32_t APBENR2;          /*!< RCC APB peripherals clock enable register2,                             Address offset: 0x40 */
  uint32_t RESERVED2[4];          /*!< Reserved,                                                               Address offset: 0x44-0x50 */
  __IO uint32_t CCIPR;            /*!< RCC Peripherals Independent Clocks Configuration Register,              Address offset: 0x54 */
  __IO uint32_t RESERVED3;        /*!< Reserved,                                                               Address offset: 0x58 */
  __IO uint32_t BDCR;             /*!< RCC Backup Domain Control Register,                                     Address offset: 0x5C */
  __IO uint32_t CSR;              /*!< RCC Unregulated Domain Clock Control and Status Register,               Address offset: 0x60 */
} RCC_TypeDef;

/**
  * @brief Real-Time Clock
  */
typedef struct
{
  __IO uint32_t CRH;              /*!< RTC Control register ,                              Address offset: 0x00 */
  __IO uint32_t CRL;              /*!< RTC Control register ,                              Address offset: 0x04 */
  __IO uint32_t PRLH;             /*!< RTC prescaler load register ,                       Address offset: 0x08 */
  __IO uint32_t PRLL;             /*!< RTC prescaler load register ,                       Address offset: 0x0C */
  __IO uint32_t DIVH;             /*!< RTC prescaler divider register ,                    Address offset: 0x10 */
  __IO uint32_t DIVL;             /*!< RTC prescaler divider register ,                    Address offset: 0x14 */
  __IO uint32_t CNTH;             /*!< RTC counter register ,                              Address offset: 0x18 */
  __IO uint32_t CNTL;             /*!< RTC counter register ,                              Address offset: 0x1C */
  __IO uint32_t ALRH;             /*!< RTC alarm register ,                                Address offset: 0x20 */
  __IO uint32_t ALRL;             /*!< RTC alarm register ,                                Address offset: 0x24 */ 
  uint32_t RESERVED1;             /*!< Reserved ,                                          Address offset: 0x28 */
  __IO uint32_t BKP_RTCCR;        /*!< RTC clock calibration register ,                    Address offset: 0x2C */
} RTC_TypeDef;

/**
  * @brief Serial Peripheral Interface
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< SPI Control register 1,                              Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< SPI Control register 2,                              Address offset: 0x04 */
  __IO uint32_t SR;               /*!< SPI Status register,                                 Address offset: 0x08 */
  __IO uint32_t DR;               /*!< SPI data register,                                   Address offset: 0x0C */
  __IO uint32_t CRCPR;            /*!< SPI CRC polynomial register,                         Address offset: 0x10 */
  __IO uint32_t RXCRC;            /*!< SPI RX CRC register,                                 Address offset: 0x14 */
  __IO uint32_t TXCRC;            /*!< SPI TX CRC register,                                 Address offset: 0x18 */
  __IO uint32_t I2SCFGR;          /*!< SPI I2S config register,                             Address offset: 0x1C */
  __IO uint32_t I2SPR;            /*!< SPI I2S prescaler register,                          Address offset: 0x20 */
} SPI_TypeDef;

/**
  * @brief System configuration controller
  */
typedef struct
{
  __IO uint32_t CFGR1;            /*!< SYSCFG configuration register 1,              Address offset: 0x00 */
  __IO uint32_t CFGR2;            /*!< SYSCFG configuration register 2,              Address offset: 0x04 */
  __IO uint32_t CFGR3;            /*!< SYSCFG configuration register 3,              Address offset: 0x08 */
  __IO uint32_t RESERVED1;        /*!< Reserved,                                     Address offset: 0x0C */  
  __IO uint32_t PA_ENS;           /*!< SYSCFG GPIOA noise filter enable register 1,  Address offset: 0x10 */
  __IO uint32_t PB_ENS;           /*!< SYSCFG GPIOB noise filter enable register 1,  Address offset: 0x14 */
  __IO uint32_t PF_ENS;           /*!< SYSCFG GPIOF noise filter enable register 1,  Address offset: 0x18 */ 
  __IO uint32_t IOCFG;            /*!< SYSCFG I2C type IO configure register,        Address offset: 0x1C */
  __IO uint32_t PA_ANA2EN;        /*!< SYSCFG GPIOA Analog2 enable register,         Address offset: 0x20 */
  __IO uint32_t PB_ANA2EN;        /*!< SYSCFG GPIOB Analog2 enable register,         Address offset: 0x24 */ 
  __IO uint32_t PF_ANA2EN;        /*!< SYSCFG GPIOF Analog2 enable register,         Address offset: 0x28 */  
} SYSCFG_TypeDef;

