OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x6.h
/******************  Bit definition for ADC_CHSELR register  ******************/
#define ADC_CHSELR_CHSEL_Pos      (0U)
#define ADC_CHSELR_CHSEL_Msk      (0x7FFFUL << ADC_CHSELR_CHSEL_Pos)            /*!< 0x00007FFF */
#define ADC_CHSELR_CHSEL           ADC_CHSELR_CHSEL_Msk                         /*!< ADC group regular sequencer channels, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL14_Pos    (14U)
#define ADC_CHSELR_CHSEL14_Msk    (0x1UL << ADC_CHSELR_CHSEL14_Pos)             /*!< 0x00004000 */
#define ADC_CHSELR_CHSEL14         ADC_CHSELR_CHSEL14_Msk                       /*!< ADC group regular sequencer channel 14, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL13_Pos    (13U)
#define ADC_CHSELR_CHSEL13_Msk    (0x1UL << ADC_CHSELR_CHSEL13_Pos)             /*!< 0x00002000 */
#define ADC_CHSELR_CHSEL13         ADC_CHSELR_CHSEL13_Msk                       /*!< ADC group regular sequencer channel 13, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL12_Pos    (12U)
#define ADC_CHSELR_CHSEL12_Msk    (0x1UL << ADC_CHSELR_CHSEL12_Pos)             /*!< 0x00001000 */
#define ADC_CHSELR_CHSEL12         ADC_CHSELR_CHSEL12_Msk                       /*!< ADC group regular sequencer channel 12, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL11_Pos    (11U)
#define ADC_CHSELR_CHSEL11_Msk    (0x1UL << ADC_CHSELR_CHSEL11_Pos)             /*!< 0x00000800 */
#define ADC_CHSELR_CHSEL11         ADC_CHSELR_CHSEL11_Msk                       /*!< ADC group regular sequencer channel 11, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL10_Pos    (10U)
#define ADC_CHSELR_CHSEL10_Msk    (0x1UL << ADC_CHSELR_CHSEL10_Pos)             /*!< 0x00000400 */
#define ADC_CHSELR_CHSEL10         ADC_CHSELR_CHSEL10_Msk                       /*!< ADC group regular sequencer channel 10, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL9_Pos     (9U)
#define ADC_CHSELR_CHSEL9_Msk     (0x1UL << ADC_CHSELR_CHSEL9_Pos)              /*!< 0x00000200 */
#define ADC_CHSELR_CHSEL9          ADC_CHSELR_CHSEL9_Msk                        /*!< ADC group regular sequencer channel 9, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL8_Pos     (8U)
#define ADC_CHSELR_CHSEL8_Msk     (0x1UL << ADC_CHSELR_CHSEL8_Pos)              /*!< 0x00000100 */
#define ADC_CHSELR_CHSEL8          ADC_CHSELR_CHSEL8_Msk                        /*!< ADC group regular sequencer channel 8, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL7_Pos     (7U)
#define ADC_CHSELR_CHSEL7_Msk     (0x1UL << ADC_CHSELR_CHSEL7_Pos)              /*!< 0x00000080 */
#define ADC_CHSELR_CHSEL7          ADC_CHSELR_CHSEL7_Msk                        /*!< ADC group regular sequencer channel 7, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL6_Pos     (6U)
#define ADC_CHSELR_CHSEL6_Msk     (0x1UL << ADC_CHSELR_CHSEL6_Pos)              /*!< 0x00000040 */
#define ADC_CHSELR_CHSEL6          ADC_CHSELR_CHSEL6_Msk                        /*!< ADC group regular sequencer channel 6, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL5_Pos     (5U)
#define ADC_CHSELR_CHSEL5_Msk     (0x1UL << ADC_CHSELR_CHSEL5_Pos)              /*!< 0x00000020 */
#define ADC_CHSELR_CHSEL5          ADC_CHSELR_CHSEL5_Msk                        /*!< ADC group regular sequencer channel 5, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL4_Pos     (4U)
#define ADC_CHSELR_CHSEL4_Msk     (0x1UL << ADC_CHSELR_CHSEL4_Pos)              /*!< 0x00000010 */
#define ADC_CHSELR_CHSEL4          ADC_CHSELR_CHSEL4_Msk                        /*!< ADC group regular sequencer channel 4, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL3_Pos     (3U)
#define ADC_CHSELR_CHSEL3_Msk     (0x1UL << ADC_CHSELR_CHSEL3_Pos)              /*!< 0x00000008 */
#define ADC_CHSELR_CHSEL3          ADC_CHSELR_CHSEL3_Msk                        /*!< ADC group regular sequencer channel 3, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL2_Pos     (2U)
#define ADC_CHSELR_CHSEL2_Msk     (0x1UL << ADC_CHSELR_CHSEL2_Pos)              /*!< 0x00000004 */
#define ADC_CHSELR_CHSEL2          ADC_CHSELR_CHSEL2_Msk                        /*!< ADC group regular sequencer channel 2, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL1_Pos     (1U)
#define ADC_CHSELR_CHSEL1_Msk     (0x1UL << ADC_CHSELR_CHSEL1_Pos)              /*!< 0x00000002 */
#define ADC_CHSELR_CHSEL1          ADC_CHSELR_CHSEL1_Msk                        /*!< ADC group regular sequencer channel 1, available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL0_Pos     (0U)
#define ADC_CHSELR_CHSEL0_Msk     (0x1UL << ADC_CHSELR_CHSEL0_Pos)              /*!< 0x00000001 */
#define ADC_CHSELR_CHSEL0          ADC_CHSELR_CHSEL0_Msk                        /*!< ADC group regular sequencer channel 0, available when ADC_CFGR1_CHSELRMOD is reset */

/******************  Bit definition for ADC_SEQR0 register  ********************/
#define ADC_SEQR0_SQ0_Pos         (0U)
#define ADC_SEQR0_SQ0_Msk         (0xFUL << ADC_SEQR0_SQ0_Pos)                  /*!< 0x0000000F */
#define ADC_SEQR0_SQ0              ADC_SEQR0_SQ0_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ0_0           (0x1UL << ADC_SEQR0_SQ0_Pos)                  /*!< 0x00000001 */
#define ADC_SEQR0_SQ0_1           (0x2UL << ADC_SEQR0_SQ0_Pos)                  /*!< 0x00000002 */
#define ADC_SEQR0_SQ0_2           (0x4UL << ADC_SEQR0_SQ0_Pos)                  /*!< 0x00000004 */
#define ADC_SEQR0_SQ0_4           (0x8UL << ADC_SEQR0_SQ0_Pos)                  /*!< 0x00000008 */
#define ADC_SEQR0_SQ1_Pos         (4U)
#define ADC_SEQR0_SQ1_Msk         (0xFUL << ADC_SEQR0_SQ1_Pos)                  /*!< 0x000000F0 */
#define ADC_SEQR0_SQ1              ADC_SEQR0_SQ1_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ1_0           (0x1UL << ADC_SEQR0_SQ1_Pos)                  /*!< 0x00000010 */
#define ADC_SEQR0_SQ1_1           (0x2UL << ADC_SEQR0_SQ1_Pos)                  /*!< 0x00000020 */
#define ADC_SEQR0_SQ1_2           (0x4UL << ADC_SEQR0_SQ1_Pos)                  /*!< 0x00000040 */
#define ADC_SEQR0_SQ1_4           (0x8UL << ADC_SEQR0_SQ1_Pos)                  /*!< 0x00000080 */
#define ADC_SEQR0_SQ2_Pos         (8U)
#define ADC_SEQR0_SQ2_Msk         (0xFUL << ADC_SEQR0_SQ2_Pos)                  /*!< 0x00000F00 */
#define ADC_SEQR0_SQ2              ADC_SEQR0_SQ2_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ2_0           (0x1UL << ADC_SEQR0_SQ2_Pos)                  /*!< 0x00000100 */
#define ADC_SEQR0_SQ2_1           (0x2UL << ADC_SEQR0_SQ2_Pos)                  /*!< 0x00000200 */
#define ADC_SEQR0_SQ2_2           (0x4UL << ADC_SEQR0_SQ2_Pos)                  /*!< 0x00000400 */
#define ADC_SEQR0_SQ2_4           (0x8UL << ADC_SEQR0_SQ2_Pos)                  /*!< 0x00000800 */
#define ADC_SEQR0_SQ3_Pos         (12U)
#define ADC_SEQR0_SQ3_Msk         (0xFUL << ADC_SEQR0_SQ3_Pos)                  /*!< 0x0000F000 */
#define ADC_SEQR0_SQ3              ADC_SEQR0_SQ3_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ3_0           (0x1UL << ADC_SEQR0_SQ3_Pos)                  /*!< 0x00001000 */
#define ADC_SEQR0_SQ3_1           (0x2UL << ADC_SEQR0_SQ3_Pos)                  /*!< 0x00002000 */
#define ADC_SEQR0_SQ3_2           (0x4UL << ADC_SEQR0_SQ3_Pos)                  /*!< 0x00004000 */
#define ADC_SEQR0_SQ3_4           (0x8UL << ADC_SEQR0_SQ3_Pos)                  /*!< 0x00008000 */
#define ADC_SEQR0_SQ4_Pos         (16U)
#define ADC_SEQR0_SQ4_Msk         (0xFUL << ADC_SEQR0_SQ4_Pos)                  /*!< 0x000F0000 */
#define ADC_SEQR0_SQ4              ADC_SEQR0_SQ4_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ4_0           (0x1UL << ADC_SEQR0_SQ4_Pos)                  /*!< 0x00010000 */
#define ADC_SEQR0_SQ4_1           (0x2UL << ADC_SEQR0_SQ4_Pos)                  /*!< 0x00020000 */
#define ADC_SEQR0_SQ4_2           (0x4UL << ADC_SEQR0_SQ4_Pos)                  /*!< 0x00040000 */
#define ADC_SEQR0_SQ4_4           (0x8UL << ADC_SEQR0_SQ4_Pos)                  /*!< 0x00080000 */
#define ADC_SEQR0_SQ5_Pos         (20U)
#define ADC_SEQR0_SQ5_Msk         (0xFUL << ADC_SEQR0_SQ5_Pos)                  /*!< 0x00F00000 */
#define ADC_SEQR0_SQ5              ADC_SEQR0_SQ5_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ5_0           (0x1UL << ADC_SEQR0_SQ5_Pos)                  /*!< 0x00100000 */
#define ADC_SEQR0_SQ5_1           (0x2UL << ADC_SEQR0_SQ5_Pos)                  /*!< 0x00200000 */
#define ADC_SEQR0_SQ5_2           (0x4UL << ADC_SEQR0_SQ5_Pos)                  /*!< 0x00400000 */
#define ADC_SEQR0_SQ5_4           (0x8UL << ADC_SEQR0_SQ5_Pos)                  /*!< 0x00800000 */
#define ADC_SEQR0_SQ6_Pos         (24U)
#define ADC_SEQR0_SQ6_Msk         (0xFUL << ADC_SEQR0_SQ6_Pos)                  /*!< 0x0F000000 */
#define ADC_SEQR0_SQ6              ADC_SEQR0_SQ6_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ6_0           (0x1UL << ADC_SEQR0_SQ6_Pos)                  /*!< 0x01000000 */
#define ADC_SEQR0_SQ6_1           (0x2UL << ADC_SEQR0_SQ6_Pos)                  /*!< 0x02000000 */
#define ADC_SEQR0_SQ6_2           (0x4UL << ADC_SEQR0_SQ6_Pos)                  /*!< 0x04000000 */
#define ADC_SEQR0_SQ6_4           (0x8UL << ADC_SEQR0_SQ6_Pos)                  /*!< 0x08000000 */
#define ADC_SEQR0_SQ7_Pos         (28U)
#define ADC_SEQR0_SQ7_Msk         (0xFUL << ADC_SEQR0_SQ7_Pos)                  /*!< 0xF0000000 */
#define ADC_SEQR0_SQ7              ADC_SEQR0_SQ7_Msk                            /*!< ADC sequence select */
#define ADC_SEQR0_SQ7_0           (0x1UL << ADC_SEQR0_SQ7_Pos)                  /*!< 0x10000000 */
#define ADC_SEQR0_SQ7_1           (0x2UL << ADC_SEQR0_SQ7_Pos)                  /*!< 0x20000000 */
#define ADC_SEQR0_SQ7_2           (0x4UL << ADC_SEQR0_SQ7_Pos)                  /*!< 0x40000000 */
#define ADC_SEQR0_SQ7_4           (0x8UL << ADC_SEQR0_SQ7_Pos)                  /*!< 0x80000000 */

