OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x6.h
/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_Pos       (0U)
#define IWDG_PR_PR_Msk       (0x7UL << IWDG_PR_PR_Pos)                         /*!< 0x00000007 */
#define IWDG_PR_PR           IWDG_PR_PR_Msk                                    /*!<PR[2:0] (Prescaler divider)         */
#define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_Pos)                         /*!< 0x00000001 */
#define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_Pos)                         /*!< 0x00000002 */
#define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_Pos)                         /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_Pos      (0U)
#define IWDG_RLR_RL_Msk      (0xFFFUL << IWDG_RLR_RL_Pos)                      /*!< 0x00000FFF */
#define IWDG_RLR_RL          IWDG_RLR_RL_Msk                                   /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_Pos      (0U)
#define IWDG_SR_PVU_Msk      (0x1UL << IWDG_SR_PVU_Pos)                        /*!< 0x00000001 */
#define IWDG_SR_PVU          IWDG_SR_PVU_Msk                                   /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos      (1U)
#define IWDG_SR_RVU_Msk      (0x1UL << IWDG_SR_RVU_Pos)                        /*!< 0x00000002 */
#define IWDG_SR_RVU          IWDG_SR_RVU_Msk                                   /*!< Watchdog counter reload value update */

/******************************************************************************/
/*                                                                            */
/*                                 LCD Controller (LCD)                       */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for LCD_CR0 register  *********************/
#define LCD_CR0_EN_Pos              (0U)                                     /*!< 0x00000001 */
#define LCD_CR0_EN_Msk              (0x1UL << LCD_CR0_EN_Pos)                /*!< desc EN */
#define LCD_CR0_EN                  LCD_CR0_EN_Msk
#define LCD_CR0_LCDCLK_Pos          (1U)
#define LCD_CR0_LCDCLK_Msk          (0x3UL << LCD_CR0_LCDCLK_Pos)            /*!< 0x00000006 */
#define LCD_CR0_LCDCLK              LCD_CR0_LCDCLK_Msk
#define LCD_CR0_LCDCLK_0            (0x1UL << LCD_CR0_LCDCLK_Pos)            /*!< 0x00000002 */
#define LCD_CR0_LCDCLK_1            (0x2UL << LCD_CR0_LCDCLK_Pos)            /*!< 0x00000004 */
#define LCD_CR0_BIAS_Pos            (5U)
#define LCD_CR0_BIAS_Msk            (0x1UL << LCD_CR0_BIAS_Pos)              /*!< 0x00000020 */
#define LCD_CR0_BIAS                LCD_CR0_BIAS_Msk
#define LCD_CR0_DUTY_Pos            (6U)
#define LCD_CR0_DUTY_Msk            (0x7UL << LCD_CR0_DUTY_Pos)              /*!< 0x000001C0 */
#define LCD_CR0_DUTY                LCD_CR0_DUTY_Msk
#define LCD_CR0_DUTY_0              (0x1UL << LCD_CR0_DUTY_Pos)              /*!< 0x00000040 */
#define LCD_CR0_DUTY_1              (0x2UL << LCD_CR0_DUTY_Pos)              /*!< 0x00000080 */
#define LCD_CR0_DUTY_2              (0x4UL << LCD_CR0_DUTY_Pos)              /*!< 0x00000100 */
#define LCD_CR0_BSEL_Pos            (9U)
#define LCD_CR0_BSEL_Msk            (0x7UL << LCD_CR0_BSEL_Pos)              /*!< 0x00000E00 */
#define LCD_CR0_BSEL                LCD_CR0_BSEL_Msk
#define LCD_CR0_BSEL_0              (0x1UL << LCD_CR0_BSEL_Pos)              /*!< 0x00000200 */
#define LCD_CR0_BSEL_1              (0x2UL << LCD_CR0_BSEL_Pos)              /*!< 0x00000400 */
#define LCD_CR0_BSEL_2              (0x4UL << LCD_CR0_BSEL_Pos)              /*!< 0x00000800 */
#define LCD_CR0_CONTRAST_Pos        (12U)
#define LCD_CR0_CONTRAST_Msk        (0xFUL << LCD_CR0_CONTRAST_Pos)          /*!< 0x0000F000 */
#define LCD_CR0_CONTRAST            LCD_CR0_CONTRAST_Msk
#define LCD_CR0_CONTRAST_0          (0x1UL << LCD_CR0_CONTRAST_Pos)          /*!< 0x00001000 */
#define LCD_CR0_CONTRAST_1          (0x2UL << LCD_CR0_CONTRAST_Pos)          /*!< 0x00002000 */ 
#define LCD_CR0_CONTRAST_2          (0x4UL << LCD_CR0_CONTRAST_Pos)          /*!< 0x00004000 */
#define LCD_CR0_CONTRAST_3          (0x8UL << LCD_CR0_CONTRAST_Pos)          /*!< 0x00008000 */

/*******************  Bit definition for LCD_CR1 register  *********************/
#define LCD_CR1_BLINKCNT_Pos        (0U)
#define LCD_CR1_BLINKCNT_Msk        (0x3FUL << LCD_CR1_BLINKCNT_Pos)
#define LCD_CR1_BLINKCNT            LCD_CR1_BLINKCNT_Msk
#define LCD_CR1_BLINKCNT_0          (0x1UL << LCD_CR1_BLINKCNT_Pos)          /*!< 0x00000001 */
#define LCD_CR1_BLINKCNT_1          (0x2UL << LCD_CR1_BLINKCNT_Pos)          /*!< 0x00000002 */
#define LCD_CR1_BLINKCNT_2          (0x4UL << LCD_CR1_BLINKCNT_Pos)          /*!< 0x00000004 */
#define LCD_CR1_BLINKCNT_3          (0x8UL << LCD_CR1_BLINKCNT_Pos)          /*!< 0x00000008 */
#define LCD_CR1_BLINKCNT_4          (0x10UL << LCD_CR1_BLINKCNT_Pos)         /*!< 0x00000010 */
#define LCD_CR1_BLINKCNT_5          (0x20UL << LCD_CR1_BLINKCNT_Pos)         /*!< 0x00000020 */
#define LCD_CR1_BLINKEN_Pos         (6U)
#define LCD_CR1_BLINKEN_Msk         (0x1UL << LCD_CR1_BLINKEN_Pos)           /*!< 0x00000040 */
#define LCD_CR1_BLINKEN             LCD_CR1_BLINKEN_Msk                      /*!< desc BLINKEN */
#define LCD_CR1_MODE_Pos            (8U)
#define LCD_CR1_MODE_Msk            (0x1UL << LCD_CR1_MODE_Pos)              /*!< 0x00000100 */
#define LCD_CR1_MODE                LCD_CR1_MODE_Msk                         /*!< desc MODE */
#define LCD_CR1_IE_Pos              (9U)
#define LCD_CR1_IE_Msk              (0x1UL << LCD_CR1_IE_Pos)                /*!< 0x00000200 */
#define LCD_CR1_IE                  LCD_CR1_IE_Msk                           /*!< desc IE */
#define LCD_CR1_DMAEN_Pos           (10U)
#define LCD_CR1_DMAEN_Msk           (0x1UL << LCD_CR1_DMAEN_Pos)             /*!< 0x00000400 */
#define LCD_CR1_DMAEN               LCD_CR1_DMAEN_Msk                        /*!< desc DMAEN */
#define LCD_CR1_INTF_Pos            (11U)
#define LCD_CR1_INTF_Msk            (0x1UL << LCD_CR1_INTF_Pos)              /*!< 0x00000800 */
#define LCD_CR1_INTF                LCD_CR1_INTF_Msk                         /*!< desc INTF */
 
/*******************  Bit definition for LCD_INTCLR register  *********************/
#define LCD_INTCLR_INTF_CLR_Pos     (10U)
#define LCD_INTCLR_INTF_CLR_Msk     (0x1UL << LCD_INTCLR_INTF_CLR_Pos)
#define LCD_INTCLR_INTF_CLR         LCD_INTCLR_INTF_CLR_Msk

/********************  Bit definition for LCD_POEN0 register  ********************/
#define LCD_POEN0_S_Pos             (0U)
#define LCD_POEN0_S_Msk             (0x3FFFUL << LCD_POEN0_S_Pos)            /*!< 0x00003FFF */
#define LCD_POEN0_S                 LCD_POEN0_S_Msk                          /*!< 32-bit Data Register         */
#define LCD_POEN0_S0_Pos            (0U)
#define LCD_POEN0_S0_Msk            (0x1UL << LCD_POEN0_S0_Pos)              /*!< 0x00000001 */
#define LCD_POEN0_S0                LCD_POEN0_S0_Msk
#define LCD_POEN0_S1_Pos            (1U)
#define LCD_POEN0_S1_Msk            (0x1UL << LCD_POEN0_S1_Pos)              /*!< 0x00000002 */
#define LCD_POEN0_S1                LCD_POEN0_S1_Msk
#define LCD_POEN0_S2_Pos            (2U)
#define LCD_POEN0_S2_Msk            (0x1UL << LCD_POEN0_S2_Pos)              /*!< 0x00000004 */
#define LCD_POEN0_S2                LCD_POEN0_S2_Msk
#define LCD_POEN0_S3_Pos            (3U)
#define LCD_POEN0_S3_Msk            (0x1UL << LCD_POEN0_S3_Pos)              /*!< 0x00000008 */
#define LCD_POEN0_S3                LCD_POEN0_S3_Msk
#define LCD_POEN0_S4_Pos            (4U)
#define LCD_POEN0_S4_Msk            (0x1UL << LCD_POEN0_S4_Pos)              /*!< 0x00000010 */
#define LCD_POEN0_S4                LCD_POEN0_S4_Msk
#define LCD_POEN0_S5_Pos            (5U)
#define LCD_POEN0_S5_Msk            (0x1UL << LCD_POEN0_S5_Pos)              /*!< 0x00000020 */
#define LCD_POEN0_S5                LCD_POEN0_S5_Msk
#define LCD_POEN0_S6_Pos            (6U)
#define LCD_POEN0_S6_Msk            (0x1UL << LCD_POEN0_S6_Pos)              /*!< 0x00000040 */
#define LCD_POEN0_S6                LCD_POEN0_S6_Msk
#define LCD_POEN0_S7_Pos            (7U)
#define LCD_POEN0_S7_Msk            (0x1UL << LCD_POEN0_S7_Pos)              /*!< 0x00000080 */
#define LCD_POEN0_S7                LCD_POEN0_S7_Msk
#define LCD_POEN0_S8_Pos            (8U)
#define LCD_POEN0_S8_Msk            (0x1UL << LCD_POEN0_S8_Pos)              /*!< 0x00000100 */
#define LCD_POEN0_S8                LCD_POEN0_S8_Msk
#define LCD_POEN0_S9_Pos            (9U)
#define LCD_POEN0_S9_Msk            (0x1UL << LCD_POEN0_S9_Pos)              /*!< 0x00000200 */
#define LCD_POEN0_S9                LCD_POEN0_S9_Msk
#define LCD_POEN0_S10_Pos           (10U)
#define LCD_POEN0_S10_Msk           (0x1UL << LCD_POEN0_S10_Pos)             /*!< 0x00000400 */
#define LCD_POEN0_S10               LCD_POEN0_S10_Msk
#define LCD_POEN0_S11_Pos           (11U)
#define LCD_POEN0_S11_Msk           (0x1UL << LCD_POEN0_S11_Pos)             /*!< 0x00000800 */
#define LCD_POEN0_S11               LCD_POEN0_S11_Msk
#define LCD_POEN0_S12_Pos           (12U)
#define LCD_POEN0_S12_Msk           (0x1UL << LCD_POEN0_S12_Pos)             /*!< 0x00001000 */
#define LCD_POEN0_S12               LCD_POEN0_S12_Msk
#define LCD_POEN0_S13_Pos           (13U)
#define LCD_POEN0_S13_Msk           (0x1UL << LCD_POEN0_S13_Pos)             /*!< 0x00002000 */
#define LCD_POEN0_S13               LCD_POEN0_S13_Msk


/********************  Bit definition for LCD_POEN1 register  ********************/
#define LCD_POEN1_S_Pos             (4U)
#define LCD_POEN1_S_Msk             (0xFUL << LCD_POEN1_S_Pos)               /*!< 0x000000F0 */
#define LCD_POEN1_S                 LCD_POEN1_S_Msk                          /*!< 32-bit Data Register         */
#define LCD_POEN1_S17_Pos           (4U)
#define LCD_POEN1_S17_Msk           (0x1UL << LCD_POEN1_S17_Pos)             /*!< 0x00000010 */
#define LCD_POEN1_S17               LCD_POEN1_S17_Msk
#define LCD_POEN1_S16_Pos           (5U)
#define LCD_POEN1_S16_Msk           (0x1UL << LCD_POEN1_S16_Pos)             /*!< 0x00000020 */
#define LCD_POEN1_S16               LCD_POEN1_S16_Msk
#define LCD_POEN1_S15_Pos           (6U)
#define LCD_POEN1_S15_Msk           (0x1UL << LCD_POEN1_S15_Pos)             /*!< 0x00000040 */
#define LCD_POEN1_S15               LCD_POEN1_S15_Msk
#define LCD_POEN1_S14_Pos           (7U)
#define LCD_POEN1_S14_Msk           (0x1UL << LCD_POEN1_S14_Pos)             /*!< 0x00000080 */
#define LCD_POEN1_S14               LCD_POEN1_S14_Msk
#define LCD_POEN1_C0_Pos            (8U)
#define LCD_POEN1_C0_Msk            (0x1UL << LCD_POEN1_C0_Pos)              /*!< 0x00000100 */
#define LCD_POEN1_C0                LCD_POEN1_C0_Msk                         /*!< desc C0 */
#define LCD_POEN1_C1_Pos            (9U)
#define LCD_POEN1_C1_Msk            (0x1UL << LCD_POEN1_C1_Pos)              /*!< 0x00000200 */
#define LCD_POEN1_C1                LCD_POEN1_C1_Msk                         /*!< desc C1 */
#define LCD_POEN1_C2_Pos            (10U)
#define LCD_POEN1_C2_Msk            (0x1UL << LCD_POEN1_C2_Pos)              /*!< 0x00000400 */
#define LCD_POEN1_C2                LCD_POEN1_C2_Msk                         /*!< desc C2 */
#define LCD_POEN1_C3_Pos            (11U)
#define LCD_POEN1_C3_Msk            (0x1UL << LCD_POEN1_C3_Pos)              /*!< 0x00000800 */
#define LCD_POEN1_C3                LCD_POEN1_C3_Msk                         /*!< desc C3 */

/********************  Bit definition for LCD_RAM0~4 register  ********************/
#define LCD_RAM_D0_Pos              (0U)
#define LCD_RAM_D0_Msk              (0x1UL << LCD_RAM_D0_Pos)                /*!< 0x00000001 */
#define LCD_RAM_D0                  LCD_RAM_D0_Msk
#define LCD_RAM_D1_Pos              (1U)
#define LCD_RAM_D1_Msk              (0x1UL << LCD_RAM_D1_Pos)                /*!< 0x00000002 */
#define LCD_RAM_D1                  LCD_RAM_D1_Msk
#define LCD_RAM_D2_Pos              (2U)
#define LCD_RAM_D2_Msk              (0x1UL << LCD_RAM_D2_Pos)                /*!< 0x00000004 */
#define LCD_RAM_D2                  LCD_RAM_D2_Msk
#define LCD_RAM_D3_Pos              (3U)
#define LCD_RAM_D3_Msk              (0x1UL << LCD_RAM_D3_Pos)                /*!< 0x00000008 */
#define LCD_RAM_D3                  LCD_RAM_D3_Msk
#define LCD_RAM_D4_Pos              (4U)
#define LCD_RAM_D4_Msk              (0x1UL << LCD_RAM_D4_Pos)                /*!< 0x00000010 */
#define LCD_RAM_D4                  LCD_RAM_D4_Msk
#define LCD_RAM_D5_Pos              (5U)
#define LCD_RAM_D5_Msk              (0x1UL << LCD_RAM_D5_Pos)                /*!< 0x00000020 */
#define LCD_RAM_D5                  LCD_RAM_D5_Msk
#define LCD_RAM_D6_Pos              (6U)
#define LCD_RAM_D6_Msk              (0x1UL << LCD_RAM_D6_Pos)                /*!< 0x00000040 */
#define LCD_RAM_D6                  LCD_RAM_D6_Msk
#define LCD_RAM_D7_Pos              (7U)
#define LCD_RAM_D7_Msk              (0x1UL << LCD_RAM_D7_Pos)                /*!< 0x00000080 */
#define LCD_RAM_D7                  LCD_RAM_D7_Msk
#define LCD_RAM_D8_Pos              (8U)
#define LCD_RAM_D8_Msk              (0x1UL << LCD_RAM_D8_Pos)                /*!< 0x00000100 */
#define LCD_RAM_D8                  LCD_RAM_D8_Msk
#define LCD_RAM_D9_Pos              (9U)
#define LCD_RAM_D9_Msk              (0x1UL << LCD_RAM_D9_Pos)                /*!< 0x00000200 */
#define LCD_RAM_D9                  LCD_RAM_D9_Msk
#define LCD_RAM_D10_Pos             (10U)
#define LCD_RAM_D10_Msk             (0x1UL << LCD_RAM_D10_Pos)               /*!< 0x00000400 */
#define LCD_RAM_D10                 LCD_RAM_D10_Msk
#define LCD_RAM_D11_Pos             (11U)
#define LCD_RAM_D11_Msk             (0x1UL << LCD_RAM_D11_Pos)               /*!< 0x00000800 */
#define LCD_RAM_D11                 LCD_RAM_D11_Msk
#define LCD_RAM_D12_Pos             (12U)
#define LCD_RAM_D12_Msk             (0x1UL << LCD_RAM_D12_Pos)               /*!< 0x00001000 */
#define LCD_RAM_D12                 LCD_RAM_D12_Msk
#define LCD_RAM_D13_Pos             (13U)
#define LCD_RAM_D13_Msk             (0x1UL << LCD_RAM_D13_Pos)               /*!< 0x00002000 */
#define LCD_RAM_D13                 LCD_RAM_D13_Msk
#define LCD_RAM_D14_Pos             (14U)
#define LCD_RAM_D14_Msk             (0x1UL << LCD_RAM_D14_Pos)               /*!< 0x00004000 */
#define LCD_RAM_D14                 LCD_RAM_D14_Msk
#define LCD_RAM_D15_Pos             (15U)
#define LCD_RAM_D15_Msk             (0x1UL << LCD_RAM_D15_Pos)               /*!< 0x00008000 */
#define LCD_RAM_D15                 LCD_RAM_D15_Msk
#define LCD_RAM_D16_Pos             (16U)
#define LCD_RAM_D16_Msk             (0x1UL << LCD_RAM_D16_Pos)               /*!< 0x00010000 */
#define LCD_RAM_D16                 LCD_RAM_D16_Msk
#define LCD_RAM_D17_Pos             (17U)
#define LCD_RAM_D17_Msk             (0x1UL << LCD_RAM_D17_Pos)               /*!< 0x00020000 */
#define LCD_RAM_D17                 LCD_RAM_D17_Msk
#define LCD_RAM_D18_Pos             (18U)
#define LCD_RAM_D18_Msk             (0x1UL << LCD_RAM_D18_Pos)               /*!< 0x00040000 */
#define LCD_RAM_D18                 LCD_RAM_D18_Msk
#define LCD_RAM_D19_Pos             (19U)
#define LCD_RAM_D19_Msk             (0x1UL << LCD_RAM_D19_Pos)               /*!< 0x00080000 */
#define LCD_RAM_D19                 LCD_RAM_D19_Msk
#define LCD_RAM_D20_Pos             (20U)
#define LCD_RAM_D20_Msk             (0x1UL << LCD_RAM_D20_Pos)               /*!< 0x00100000 */
#define LCD_RAM_D20                 LCD_RAM_D20_Msk
#define LCD_RAM_D21_Pos             (21U)
#define LCD_RAM_D21_Msk             (0x1UL << LCD_RAM_D21_Pos)               /*!< 0x00200000 */
#define LCD_RAM_D21                 LCD_RAM_D21_Msk
#define LCD_RAM_D22_Pos             (22U)
#define LCD_RAM_D22_Msk             (0x1UL << LCD_RAM_D22_Pos)               /*!< 0x00400000 */
#define LCD_RAM_D22                 LCD_RAM_D22_Msk
#define LCD_RAM_D23_Pos             (23U)
#define LCD_RAM_D23_Msk             (0x1UL << LCD_RAM_D23_Pos)               /*!< 0x00800000 */
#define LCD_RAM_D23                 LCD_RAM_D23_Msk
#define LCD_RAM_D24_Pos             (24U)
#define LCD_RAM_D24_Msk             (0x1UL << LCD_RAM_D24_Pos)               /*!< 0x01000000 */
#define LCD_RAM_D24                 LCD_RAM_D24_Msk
#define LCD_RAM_D25_Pos             (25U)
#define LCD_RAM_D25_Msk             (0x1UL << LCD_RAM_D25_Pos)               /*!< 0x02000000 */
#define LCD_RAM_D25                 LCD_RAM_D25_Msk
#define LCD_RAM_D26_Pos             (26U)
#define LCD_RAM_D26_Msk             (0x1UL << LCD_RAM_D26_Pos)               /*!< 0x04000000 */
#define LCD_RAM_D26                 LCD_RAM_D26_Msk
#define LCD_RAM_D27_Pos             (27U)
#define LCD_RAM_D27_Msk             (0x1UL << LCD_RAM_D27_Pos)               /*!< 0x08000000 */
#define LCD_RAM_D27                 LCD_RAM_D27_Msk
#define LCD_RAM_D28_Pos             (28U)
#define LCD_RAM_D28_Msk             (0x1UL << LCD_RAM_D28_Pos)               /*!< 0x10000000 */
#define LCD_RAM_D28                 LCD_RAM_D28_Msk
#define LCD_RAM_D29_Pos             (29U)
#define LCD_RAM_D29_Msk             (0x1UL << LCD_RAM_D29_Pos)               /*!< 0x20000000 */
#define LCD_RAM_D29                 LCD_RAM_D29_Msk
#define LCD_RAM_D30_Pos             (30U)
#define LCD_RAM_D30_Msk             (0x1UL << LCD_RAM_D30_Pos)               /*!< 0x40000000 */
#define LCD_RAM_D30                 LCD_RAM_D30_Msk
#define LCD_RAM_D31_Pos             (31U)
#define LCD_RAM_D31_Msk             (0x1UL << LCD_RAM_D31_Pos)               /*!< 0x80000000 */
#define LCD_RAM_D31                 LCD_RAM_D31_Msk

/******************************************************************************/
/*                                                                            */
/*                        Power Control (PWR)                                 */
/*                                                                            */
/******************************************************************************/
#define PWR_PVD_SUPPORT                       /*!< PWR feature available only on specific devices: Power Voltage Detection feature */
#define PWR_BOR_SUPPORT                       /*!< PWR feature available only on specific devices: Brown-Out Reset feature         */
#define PWR_SHDW_SUPPORT                      /*!< PWR feature available only on specific devices: Shutdown mode */

/********************  Bit definition for PWR_CR1 register  ********************/
#define PWR_CR1_DBP_Pos              (8U)
#define PWR_CR1_DBP_Msk              (0x1UL << PWR_CR1_DBP_Pos)                   /*!< 0x00000100 */
#define PWR_CR1_DBP                  PWR_CR1_DBP_Msk                              /*!< Disable Backup Domain write protection */
#define PWR_CR1_FLS_SLPTIME_Pos      (12U)
#define PWR_CR1_FLS_SLPTIME_Msk      (0x3UL << PWR_CR1_FLS_SLPTIME_Pos)           /*!< 0x00003000 */
#define PWR_CR1_FLS_SLPTIME          PWR_CR1_FLS_SLPTIME_Msk
#define PWR_CR1_FLS_SLPTIME_0        (0x1UL << PWR_CR1_FLS_SLPTIME_Pos)
#define PWR_CR1_FLS_SLPTIME_1        (0x2UL << PWR_CR1_FLS_SLPTIME_Pos)
#define PWR_CR1_LPR_Pos              (14U)
#define PWR_CR1_LPR_Msk              (0x3UL << PWR_CR1_LPR_Pos)                   /*!< 0x0000C000 */
#define PWR_CR1_LPR                  PWR_CR1_LPR_Msk                              /*!< Regulator Low-Power Run mode */
#define PWR_CR1_LPR_0                (0x1UL << PWR_CR1_LPR_Pos)                   /*!< 0x00004000 */
#define PWR_CR1_LPR_1                (0x2UL << PWR_CR1_LPR_Pos)                   /*!< 0x00008000 */

#define PWR_CR1_SRAM_RETV_CTRL_Pos   (18U)
#define PWR_CR1_SRAM_RETV_CTRL_Msk   (0x1UL << PWR_CR1_SRAM_RETV_CTRL_Pos)
#define PWR_CR1_SRAM_RETV_CTRL       PWR_CR1_SRAM_RETV_CTRL_Msk


/********************  Bit definition for PWR_CR2 register  ********************/
#define PWR_CR2_PVDE_Pos             (0U)
#define PWR_CR2_PVDE_Msk             (0x1UL << PWR_CR2_PVDE_Pos)                  /*!< 0x00000001 */
#define PWR_CR2_PVDE                 PWR_CR2_PVDE_Msk                             /*!< Programmable Voltage Detector Enable */
#define PWR_CR2_SRCSEL_Pos           (2U)
#define PWR_CR2_SRCSEL_Msk           (0x1UL << PWR_CR2_SRCSEL_Pos)                /*!< 0x00000004*/
#define PWR_CR2_SRCSEL               PWR_CR2_SRCSEL_Msk                           /*!<  Selection bit field */
#define PWR_CR2_PVDT_Pos             (4U)
#define PWR_CR2_PVDT_Msk             (0x7UL << PWR_CR2_PVDT_Pos)                  /*!< 0x00000070 */
#define PWR_CR2_PVDT                 PWR_CR2_PVDT_Msk                             /*!< PVD Rising Threshold Selection bit field */
#define PWR_CR2_PVDT_0               (0x1UL << PWR_CR2_PVDT_Pos)                  /*!< 0x00000010 */
#define PWR_CR2_PVDT_1               (0x2UL << PWR_CR2_PVDT_Pos)                  /*!< 0x00000020 */
#define PWR_CR2_PVDT_2               (0x4UL << PWR_CR2_PVDT_Pos)                  /*!< 0x00000040 */
#define PWR_CR2_FLTEN_Pos            (8U)
#define PWR_CR2_FLTEN_Msk            (0x1UL << PWR_CR2_FLTEN_Pos)                 /*!< 0x00000100 */
#define PWR_CR2_FLTEN                PWR_CR2_FLTEN_Msk                            /*!< filter enable control bit field */
#define PWR_CR2_FLT_TIME_Pos         (9U)
#define PWR_CR2_FLT_TIME_Msk         (0x7UL << PWR_CR2_FLT_TIME_Pos)              /*!< 0x00000E00*/
#define PWR_CR2_FLT_TIME             PWR_CR2_FLT_TIME_Msk                         /*!<  Selection bit field */
#define PWR_CR2_FLT_TIME_0           (0x1UL << PWR_CR2_FLT_TIME_Pos)              /*!< 0x00000200 */
#define PWR_CR2_FLT_TIME_1           (0x2UL << PWR_CR2_FLT_TIME_Pos)              /*!< 0x00000400 */
#define PWR_CR2_FLT_TIME_2           (0x4UL << PWR_CR2_FLT_TIME_Pos)              /*!< 0x00000800 */

/********************  Bit definition for PWR_SR register  ********************/
#define PWR_SR_PVDO_Pos              (11U)
#define PWR_SR_PVDO_Msk              (0x1UL << PWR_SR_PVDO_Pos)                   /*!< 0x00000800 */
#define PWR_SR_PVDO                  PWR_SR_PVDO_Msk                              /*!< Power voltage detector output */



/******************************************************************************/
/*                                                                            */
/*                           Reset and Clock Control (RCC)                    */
/*                                                                            */
/******************************************************************************/
/*
* @brief Specific device feature definitions
*/
#define RCC_LSE_SUPPORT
#define RCC_PLL_SUPPORT

